{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What parks are available in Skye Canyon Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Skye Canyon features five community parks: the 15-acre Skye Canyon Park (main hub with pool and fitness center), Eagle Canyon Park, Skye View Park, Big Skye Park, and Starlight Park, each offering unique recreational amenities."
      }
    },
    {
      "@type": "Question",
      "name": "What are the hours for Skye Canyon Park?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Skye Canyon Park is open daily from 6:00am to 9:00pm, located at 10111 W Skye Canyon Park Drive, Las Vegas, NV 89166, adjacent to Skye Center and Skye Fitness."
      }
    },
    {
      "@type": "Question",
      "name": "Does Skye Canyon have a swimming pool?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, the main Skye Canyon Park features a Junior Olympic swimming pool with resident-only access, plus splash pads for children and families throughout the community parks."
      }
    },
    {
      "@type": "Question",
      "name": "What sports facilities are available at Skye Canyon parks?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Skye Canyon parks offer basketball courts with 6 hoops, grass fields with football and soccer goal posts, ½ mile walking paths, and various recreational areas for active lifestyles."
      }
    },
    {
      "@type": "Question",
      "name": "Are Skye Canyon parks family friendly?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Absolutely! Skye Canyon parks feature covered play areas, splash pads, safe play structures, and family-oriented amenities designed for children of all ages in a secure guard-gated community."
      }
    },
    {
      "@type": "Question",
      "name": "Can residents host events at Skye Canyon parks?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, the 15-acre Skye Canyon Park serves as the community's main event venue with large green spaces perfect for neighborhood gatherings and community celebrations."
      }
    }
  ],
  "about": {
    "@type": "Place",
    "name": "Skye Canyon Parks",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Las Vegas",
      "addressRegion": "Nevada",
      "postalCode": "89166"
    }
  },
  "provider": {
    "@type": "RealEstateAgent",
    "name": "Dr. Jan Duffy",
    "license": "S.0197614",
    "telephone": "(702) 500-1902",
    "email": "DrDuffy@SkyeCanyonHomesForSale.com",
    "knowsAbout": [
      "Skye Canyon Parks Recreation",
      "Community Amenities",
      "Family-Friendly Features",
      "Fitness Facilities"
    ]
  }
}