{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What home builders are in Skye Canyon Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Century Communities is the primary new construction builder in Skye Canyon, offering three distinct communities: Eaglepointe and Marvella starting in the high $500s, and Skyecrest starting in the low $700s."
      }
    },
    {
      "@type": "Question",
      "name": "What is the price range for new homes in Skye Canyon?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "New construction homes in Skye Canyon by Century Communities range from the high $500s to the low $700s and up, with flexible floor plans and luxury customization options available."
      }
    },
    {
      "@type": "Question",
      "name": "How many bedrooms do Century Communities homes have?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Century Communities homes in Skye Canyon offer up to six bedrooms with flexible floor plans that allow customization with additional lofts, bedrooms, dens, and luxurious primary suites."
      }
    },
    {
      "@type": "Question",
      "name": "Do Skye Canyon new homes have garages?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Century Communities homes in Skye Canyon feature both 2-bay and 3-bay garages, providing ample storage and parking for residents and their recreational equipment."
      }
    },
    {
      "@type": "Question",
      "name": "Are quick move-in homes available in Skye Canyon?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Century Communities offers quick move-in homes in Skye Canyon for buyers who need faster occupancy. Contact Dr. Jan Duffy at (702) 500-1902 for current inventory and availability."
      }
    },
    {
      "@type": "Question",
      "name": "What makes Century Communities homes special?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Century Communities homes feature flexible floor plans for every life stage, generous outdoor spaces to enjoy the desert climate, and extensive customization options with premium finishes."
      }
    }
  ],
  "about": {
    "@type": "Place",
    "name": "Skye Canyon Communities",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Las Vegas",
      "addressRegion": "Nevada",
      "postalCode": "89166"
    }
  },
  "provider": {
    "@type": "RealEstateAgent",
    "name": "Dr. Jan Duffy",
    "license": "S.0197614",
    "telephone": "(702) 500-1902",
    "email": "DrDuffy@SkyeCanyonHomesForSale.com",
    "specialization": "New Construction and Century Communities Expert"
  }
}