{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What elementary schools serve Skye Canyon Las Vegas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Skye Canyon is served by three excellent K-5 elementary schools: William & Mary Scherkenbach Elementary School, James Bilbray Elementary School, and Kenneth Divich Elementary, all part of Clark County School District."
      }
    },
    {
      "@type": "Question", 
      "name": "Which middle schools do Skye Canyon students attend?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Skye Canyon students attend Ralph Cadwallader Middle School or Edmundo Escobedo Sr Middle School, both highly-rated Clark County School District middle schools serving the northwest Las Vegas area."
      }
    },
    {
      "@type": "Question",
      "name": "What is the zoned high school for Skye Canyon Nevada?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Arbor View High School is the zoned high school for Skye Canyon residents, known for excellent academics, athletics programs, and college preparation courses in Las Vegas Nevada."
      }
    },
    {
      "@type": "Question",
      "name": "Are there charter school options in Skye Canyon?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, Somerset Academy Skye Canyon Campus offers K-12 charter education with smaller class sizes, specialized programs, and innovative teaching methods for Skye Canyon families."
      }
    },
    {
      "@type": "Question",
      "name": "Will Skye Canyon get its own schools?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Future development plans include a K-5 elementary school, middle school, and high school within Skye Canyon community, subject to Clark County School District funding and enrollment projections."
      }
    },
    {
      "@type": "Question",
      "name": "How do I find school zoning for my Skye Canyon address?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Visit Clark County School District website for elementary, middle, and high school zoning maps, or contact Dr. Jan Duffy at (702) 500-1902 for assistance with school information for specific Skye Canyon properties."
      }
    }
  ],
  "about": {
    "@type": "Place",
    "name": "Skye Canyon",
    "address": {
      "@type": "PostalAddress",
      "addressLocality": "Las Vegas",
      "addressRegion": "Nevada",
      "postalCode": "89166"
    }
  },
  "provider": {
    "@type": "RealEstateAgent",
    "name": "Dr. Jan Duffy",
    "license": "S.0197614",
    "telephone": "(702) 500-1902",
    "email": "DrDuffy@SkyeCanyonHomesForSale.com"
  }
}